<script setup lang="ts">

</script>

<template>
  <div class="content">
    <el-scrollbar style="max-width: 100%; max-height: 100%; margin: 10px 25px; overflow-y: visible" height="85vh">
      <h2>一、 题目的技术背景和设计依据</h2>
      <p>人脸识别也叫面部识别，是一种基于人的脸部特征信息进行身份识别的生物识别技术。它用摄像机或摄像头采集含有人脸的图像或视频流，并自动在图像中检测和跟踪人脸，进而对检测到的人脸进行脸部的一系列相关技术。人脸图像的采集一般分为两种途径，有人脸图像的批量导入和人脸图像的实时采集；预处理的目的是在系统对人脸图像的检测基础之上，对人脸图像做出进一步的处理以利于人脸图像的特征提取。目前在全球范围内，从事人脸识别技术的企业很多，国外知名的有google、facebook、斯坦福、卡耐基等;国内这些年也涌现了很多实力派，如海康威视、科大讯飞、商汤科技、云从科技、江西吉为科技等。</p>
      <p>国内这些主流的人脸识别企业，技术方案各有特点。如江西吉为科技的人脸识别技术，其人脸识别系统在识别准确率上非常不错，均融合深度学习算法，前后端深度智能为人脸大数据应用提供有力支撑。</p>
      <p>人脸识别系统广泛应用于智慧城市、交通枢纽、智慧医疗、商业连锁、银行、学校、园区、边检等各行各业。在考勤系统、远程认证、门禁系统、娱乐应用等众多领域广泛应用。</p>
      <h2>二、 选题目的、意义</h2>
      <p>随着当今社会大环境的发展下，智能系统已经成为必不可少的一部分。就拿校园门禁系统举例，在没有智能门禁系统之前，学校通常采用出入门禁登记核查模式，确保出入人员信息和校园安全。但是这种方式出入效率低，身份认证和信息登记流程繁琐，工作人员投入成本较大，而且容易出现无法准确核实身份等问题。同时在特殊情况下，这种出入登记核查的方式也增加了人员不必要的见面和交流。因此原因，我认为一款可以快速是别人人员信息，可以完整录入储存人员信息的智慧门禁系统的开发与设计就非常有必要，目前市场上门禁系统大多是卡片识别，虽然成本低，但是容易复制，磨损快，或者密码出入，容易泄露安全性差，所以基于此背景我决定设计开发一款基于人脸识别的学生请假智慧门禁系统，基于Deepface完成终端门禁人脸识别功能，并集成人脸录入。基于VUE3+html+css完成服务端及移动端相关网页服务搭设。基于SQlite数据库完成用户信息存储。基于python+flask完成后端数据库访问/查询。基于arduino+Raspberry Pi完成门禁终端机的闸机控制/数据库缓存等。完成一款基于人工智能+5G的校园出入管理系统。该系统能够自动化、准确地核实请假学生身份与审批验证，使得离校人员信息可查、可控，避免了不必要的人员接触，提高了门禁管理的智能性与安全性。</p>
      <h2>三、 参考文献</h2>
      <ol style="box-sizing: border-box">
        <li>中国安防网，智能感应门禁系统的概述及功能特点，安防行业，2005</li>
        <li>毕业论文网，密码门禁系统文献综述,通信工程，2007</li>
        <li>陆伟良等，智能小区与智能住宅,高等教育出版社，2006</li>
        <li>秦兆海，智能楼宇安全防范系统,清华大学出版社，2007</li>
        <li>赵文娟，论如何构建可信的门禁系统[J]. 科技资讯, 2021(2): 122-123.</li>
        <li>黄颖，门禁系统的设计与实现[J]. 智能技术, 2022(1): 90-94.</li>
        <li>李圣华，基于Trusted Computing的门禁系统安全研究[J]. 电子技术应用, 2022(2): 85-89.</li>
        <li>刘煜，基于FPGA的门禁控制系统设计[J]. 现代电子技术, 2023(1): 92-96.</li>
        <li>宋晨，基于人脸识别技术的智能门禁系统设计[J]. 计算机技术与发展, 2023(2): 116-120.</li>
      </ol>
    </el-scrollbar>
  </div>
</template>

<style lang="scss" scoped>
.content {
  box-sizing: border-box;

  display: flex;
  flex-direction: row;
  justify-content: center;
}
</style>